# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [13]:
import pandas as pd
import numpy as np
import swifter

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [38]:
series1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
series2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
series3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [39]:
all_series = pd.concat([series1, series2, series3], axis=1)
all_series.head()

   0  1      2
0  2  3  16883
1  1  3  25935
2  2  2  17994
3  4  1  12456
4  2  1  25186

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [40]:
all_series.rename(columns={0:'bedrs', 1:'bathrs', 2:'price_sqr_meter'}, inplace=True)
all_series

    bedrs  bathrs  price_sqr_meter
0       2       3            16883
1       1       3            25935
2       2       2            17994
3       4       1            12456
4       2       1            25186
..    ...     ...              ...
95      2       3            23342
96      1       3            26225
97      3       1            16644
98      1       2            16989
99      3       2            14553

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [41]:
bigcolumn = pd.concat([series1, series2, series3], axis=0)

bigcolumn = bigcolumn.to_frame()

bigcolumn

        0
0       2
1       1
2       2
3       4
4       2
..    ...
95  23342
96  26225
97  16644
98  16989
99  14553

[300 rows x 1 columns]

### Step 6. Ops it seems it is going only until index 99. Is it true?

In [42]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [44]:
bigcolumn.reset_index(drop=True)

         0
0        2
1        1
2        2
3        4
4        2
..     ...
295  23342
296  26225
297  16644
298  16989
299  14553

[300 rows x 1 columns]